Consider the data set [audit.csv](https://raw.githubusercontent.com/Gunnvant/PythonForModellers/master/Data/audit.csv), it has characteristics of 2000 tax returns, the data set includes the following variables:
- ID: Unique Identifier for each person
- Age: Age of person
- Employment: Type of Employment
- Education: Highest level of education
- Marital: Current Marital Status
- Occupation: Type of occupation
- Income: Amount of Income declared
- Gender: Gender of Person
- Deductions: Total amount of expenses that a person claims in their financial statements
- Hours: Average hours worked on a weekly basis
- RISK_Adjustment: The continuous target variable; this variable records the monetary amount of any adjustment to the person’s financial claims as a result of a productive audit. This variable is a measure of the size of the risk associated with the person.
- TARGET_Adjusted: The binary target variable for classification modeling (0/1), indicating nonproductive and productive audits, respectively. Productive audits are those that result in an adjustment being made to a client’s financial statement.

**Q1. Compute the %age of productive audits across**

(a) Gender
(b) Marital Status
(c) Education level

**Q2: Find the quartiles for**: 

(a) Age
(b) Income

In [1]:
path = "https://raw.githubusercontent.com/Gunnvant/PythonForModellers/master/Data/audit.csv"
import pandas as pd
data = pd.read_csv(path)

In [2]:
data.head(2)

,ID,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours,RISK_Adjustment,TARGET_Adjusted
0,1004641,38,Private,College,Unmarried,Service,81838.0,Female,0.0,72,0,0
1,1010229,35,Private,Associate,Absent,Transport,72099.0,Male,0.0,30,0,0

In [3]:
data.groupby('Gender').agg({'TARGET_Adjusted':'mean'})

        TARGET_Adjusted
Gender
Female         0.107595
Male           0.288743

In [4]:
data.groupby('Marital').agg({'TARGET_Adjusted':'mean'})

                       TARGET_Adjusted
Marital
Absent                        0.044843
Divorced                      0.075188
Married                       0.438386
Married-spouse-absent         0.090909
Unmarried                     0.074627
Widowed                       0.067797

In [5]:
data.groupby('Education').agg({'TARGET_Adjusted':'mean'})

              TARGET_Adjusted
Education
Associate            0.304348
Bachelor             0.423188
College              0.178733
Doctorate            0.629630
HSgrad               0.151515
Master               0.558824
Preschool            0.000000
Professional         0.708333
Vocational           0.174419
Yr10                 0.068966
Yr11                 0.040541
Yr12                 0.058824
Yr1t4                0.000000
Yr5t6                0.086957
Yr7t8                0.000000
Yr9                  0.037037

In [6]:
data.head(2)

,ID,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours,RISK_Adjustment,TARGET_Adjusted
0,1004641,38,Private,College,Unmarried,Service,81838.0,Female,0.0,72,0,0
1,1010229,35,Private,Associate,Absent,Transport,72099.0,Male,0.0,30,0,0

In [9]:
## Q1, <=25%
## Q2, <=50%-Median
## Q3, <=75%
data['Age'].quantile(0.25)

28.0

In [11]:
data['Age'].quantile(0.5)

37.0

In [12]:
data['Age'].quantile(0.75)

48.0

### Tabular Data Manipulation
- Filter
- Sort
- Groupby tasks

### Today

- Date information (how to deal with dates)
- Loop through a df or a column of a dataframe and clean data/do some operations
- How to join the dataframes in a style similar to sql

In [13]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/stores.csv"
stores = pd.read_csv(path)

In [15]:
stores.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11-09-2013,11-12-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [21]:
stores['Order Date']=pd.to_datetime(stores['Order Date'])

In [23]:
stores['Ship Date'] = pd.to_datetime(stores['Ship Date'])

In [24]:
stores.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code               int64
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
Quantity                  int64
Discount                float64
Profit                  float64
dtype: object

In [26]:
stores['Order Date'].dt.month

0       11
1       11
2        6
3       10
4       10
        ..
9989     1
9990     2
9991     2
9992     2
9993     5
Name: Order Date, Length: 9994, dtype: int64

In [27]:
stores['Order Date'].dt.year

0       2013
1       2013
2       2013
3       2012
4       2012
        ...
9989    2011
9990    2014
9991    2014
9992    2014
9993    2014
Name: Order Date, Length: 9994, dtype: int64

In [28]:
stores['Order Date'].dt.week

/var/folders/7h/01sjg2sx6tl3y72r2klm24c80000gn/T/ipykernel_23590/3474227015.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  stores['Order Date'].dt.week

0       45
1       45
2       24
3       41
4       41
        ..
9989     3
9990     9
9991     9
9992     9
9993    19
Name: Order Date, Length: 9994, dtype: int64

In [31]:
stores['Order Date'].dt.weekday ## Monday 0, Sunday 6

0       5
1       5
2       3
3       3
4       3
       ..
9989    5
9990    3
9991    3
9992    3
9993    0
Name: Order Date, Length: 9994, dtype: int64

### Class Excercise: Flight Delays Dataset

**Load the data set FlightDelays, the data has information on the flights over the year 2004 and if a particular flight was delayed or not.**
1. Find out the number of delayed flights for all weekdays
2. Find the average distance, total distance and count for all delayed flights on Friday.
3. Find out how many flights were on time on Week days and Weekends (Consider Saturday and Sunday as weekends)
4. Find out the number of flights for each destination across all weekdays
5. Find out the number of times weather was bad across all weekdays. (1 indicates bad weather)

In [32]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/FlightDelays.csv"

In [33]:
fd = pd.read_csv(path)
fd.head(2)

,schedtime,carrier,deptime,dest,distance,date,flightnumber,origin,weather,tailnu,delay
0,1455,OH,1455,JFK,184,01-01-2004,5935,BWI,0,N940CA,ontime
1,1640,DH,1640,JFK,213,01-01-2004,6155,DCA,0,N405FJ,ontime

In [34]:
fd['date'] = pd.to_datetime(fd['date'])

In [37]:
fd['dayofweek'] = fd['date'].dt.weekday

In [38]:
fd.head(2)

,schedtime,carrier,deptime,dest,distance,date,flightnumber,origin,weather,tailnu,delay,dayofweek
0,1455,OH,1455,JFK,184,2004-01-01,5935,BWI,0,N940CA,ontime,3
1,1640,DH,1640,JFK,213,2004-01-01,6155,DCA,0,N405FJ,ontime,3

In [41]:
fd['delay'].unique()

array(['ontime', 'delayed'], dtype=object)

In [45]:
## Q1
fd.query("dayofweek<5 and delay=='delayed'").shape[0]

336

In [50]:
## Q2
fd.query("dayofweek==4 and delay == 'delayed'")['distance'].mean()

210.28

In [51]:
fd.query("dayofweek==4 and delay == 'delayed'")['distance'].sum()

15771

In [53]:
fd.query("dayofweek==4 and delay == 'delayed'")['distance'].shape[0]

75

In [58]:
## Q3 (Weekdays)
fd.query("dayofweek<5 and delay == 'ontime'").shape[0]

1362

In [56]:
## Q3 (Weekends)
fd.query("dayofweek>=5 and delay == 'ontime'").shape[0]

411

In [62]:
## Q4
fd.query("dayofweek<5").groupby('dest').agg({'dest':'count'})
## select count(col),sum(col)

      dest
dest
EWR    507
JFK    272
LGA    919

In [63]:
fd.agg({'distance':'mean'})

distance    211.871422
dtype: float64

In [65]:
fd.query("dayofweek<5 and weather==1").shape[0] ## count(*)

30

In [67]:
fd.query("dayofweek<5 and weather==1").agg({'weather':'count'})

weather    30
dtype: int64

In [68]:
fd.groupby("dayofweek").agg({"dayofweek":"count"})

           dayofweek
dayofweek
0                308
1                307
2                320
3                372
4                391
5                250
6                253

In [69]:
fd['dayofweek'].value_counts()

4    391
3    372
2    320
0    308
1    307
6    253
5    250
Name: dayofweek, dtype: int64

In [71]:
fd.query("dayofweek<5 and weather==1").groupby('dayofweek').agg({'dayofweek':'count'})

           dayofweek
dayofweek
0                 14
1                 15
4                  1

In [72]:
stores.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

 Categorize sales based on its magnitude as given below:
- if sales> 5000, high
- if 2000<sales<=5000, medium
- if sales<2000, low

In [74]:
stores.head(1)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136

```python
stores['Sales'].map(func)
```

In [78]:
from utils import get_cat

In [ ]:
def get_cat(val):
    if val > 5000:
        return "high"
    elif val<=5000 and val>2000:
        return "medium"
    else:
        return "low"

In [79]:
stores['Sales'].map(get_cat)

0       low
1       low
2       low
3       low
4       low
       ...
9989    low
9990    low
9991    low
9992    low
9993    low
Name: Sales, Length: 9994, dtype: object

### Class Excercise: Comey Dataset

Use the dataset names `comey.csv`. You need to use the idea of map and find out the length of each response and each question. The you need to see if there is any difference between the lengths by party affiliattion. You can read more about the testimony of James Comey (former FBI director) [here](https://www.intelligence.senate.gov/sites/default/files/documents/os-jcomey-060817.pdf?)

In [82]:
path = "https://raw.githubusercontent.com/Gunnvant/corp_trainings/main/tiger_analytics/data/comey.csv"
comey = pd.read_csv(path,encoding="latin1")

In [89]:
comey.head(2)

,Senator,Party Affiliation,Full Question,Comey,Comey Response
0,BURR,Republican,Do you have any doubt that Russia attempted to...,COMEY,None.
1,BURR,Republican,Do you have any doubt that the Russian governm...,COMEY,"No, no doubt."

In [90]:
s = "This is a sentence"
len(s)

18

In [91]:
s.split()

['This', 'is', 'a', 'sentence']

In [92]:
len(s.split())

4

In [93]:
def get_len(s):
    return len(s.split())

In [95]:
comey['ques_len'] = comey['Full Question'].map(get_len)

In [96]:
comey['ans_len'] = comey['Comey Response'].map(get_len)

In [97]:
comey.head(2)

,Senator,Party Affiliation,Full Question,Comey,Comey Response,ques_len,ans_len
0,BURR,Republican,Do you have any doubt that Russia attempted to...,COMEY,None.,14,1
1,BURR,Republican,Do you have any doubt that the Russian governm...,COMEY,"No, no doubt.",26,3

In [101]:
comey.groupby('Party Affiliation').agg({'ques_len':'mean','ans_len':'mean'})

                    ques_len    ans_len
Party Affiliation
Democrat           37.236364  43.309091
Independent        29.500000  23.350000
Republican         39.839286  25.875000

In [102]:
stores.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

if the ship mode is first class then we incur an additional cost of 200 and this should be subtracted from the sales

apply() method in a dataframe

In [103]:
def correct(row):
    if row['Ship Mode'] == "First Class":
        return row['Sales'] - 200
    else:
        return row['Sales']

In [105]:
stores.apply(correct,axis=1) ### axis=1, mean we are iterating over each row

0       261.9600
1       731.9400
2        14.6200
3       957.5775
4        22.3680
          ...
9989     25.2480
9990     91.9600
9991    258.5760
9992     29.6000
9993    243.1600
Length: 9994, dtype: float64

In [106]:
stores.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code               int64
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
Quantity                  int64
Discount                float64
Profit                  float64
dtype: object

In [107]:
cols = ['Sales',"Quantity","Discount","Profit"]

In [108]:
stores[cols]

         Sales  Quantity  Discount    Profit
0     261.9600         2      0.00   41.9136
1     731.9400         3      0.00  219.5820
2      14.6200         2      0.00    6.8714
3     957.5775         5      0.45 -383.0310
4      22.3680         2      0.20    2.5164
...        ...       ...       ...       ...
9989   25.2480         3      0.20    4.1028
9990   91.9600         2      0.00   15.6332
9991  258.5760         2      0.20   19.3932
9992   29.6000         4      0.00   13.3200
9993  243.1600         2      0.00   72.9480

[9994 rows x 4 columns]

In [109]:
def Sum(C):
    return C.sum()

In [113]:
stores[cols].apply(Sum,axis=0)

Sales       2.297201e+06
Quantity    3.787300e+04
Discount    1.561090e+03
Profit      2.863970e+05
dtype: float64

## Joins

In [114]:
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/customers.csv"
customers = pd.read_csv(path)
path = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/accounts.csv"
accounts = pd.read_csv(path)

In [116]:
customers

  Cust_id  Age
0     AA1   17
1     AA2   18
2     AA3   33
3     AA4   21
4     AA5   14
5     AA6   81

In [117]:
accounts

  CustID Account Type
0    AA1          AAA
1    AA6           AA
2    AA4            B
3    AA7          CCC
4   AA12          AAA
5   AA10          DDD

In [118]:
## Inner
pd.merge(customers,accounts,how="inner",left_on="Cust_id",right_on="CustID")

  Cust_id  Age CustID Account Type
0     AA1   17    AA1          AAA
1     AA4   21    AA4            B
2     AA6   81    AA6           AA

In [119]:
## Left Outer Join
pd.merge(customers,accounts,how="left",left_on="Cust_id",right_on="CustID")

  Cust_id  Age CustID Account Type
0     AA1   17    AA1          AAA
1     AA2   18    NaN          NaN
2     AA3   33    NaN          NaN
3     AA4   21    AA4            B
4     AA5   14    NaN          NaN
5     AA6   81    AA6           AA

In [120]:
## Right Outer Join
pd.merge(customers,accounts,how="right",left_on="Cust_id",right_on="CustID")

  Cust_id   Age CustID Account Type
0     AA1  17.0    AA1          AAA
1     AA6  81.0    AA6           AA
2     AA4  21.0    AA4            B
3     NaN   NaN    AA7          CCC
4     NaN   NaN   AA12          AAA
5     NaN   NaN   AA10          DDD

In [121]:
## Outer Join
pd.merge(customers,accounts,how="outer",left_on="Cust_id",right_on="CustID")

  Cust_id   Age CustID Account Type
0     AA1  17.0    AA1          AAA
1     AA2  18.0    NaN          NaN
2     AA3  33.0    NaN          NaN
3     AA4  21.0    AA4            B
4     AA5  14.0    NaN          NaN
5     AA6  81.0    AA6           AA
6     NaN   NaN    AA7          CCC
7     NaN   NaN   AA12          AAA
8     NaN   NaN   AA10          DDD

In [127]:
accounts.to_csv("accounts.csv")

### Class Excercise (Joins)

- Use the files contributions.csv and candidates.csv. The file contributions.csv contains data on contributions made to political parties. The file candidates.csv contains data on the demographics of candidates belonging to different political parties. What was the highest contribution made on a Sunday?

- Use the files contributions.csv and candidates.csv. The file contributions.csv contains data on contributions made to political parties. The file candidates.csv contains data on the demographics of candidates belonging to different political parties. Is there a difference between the average donations received by Democrats on weekdays vs weekends? (In the column party, R stands for Republican and D stands for Democrats)

- Use the files contributions.csv and candidates.csv. The file contributions.csv contains data on contributions made to political parties. The file candidates.csv contains data on the demographics of candidates belonging to different political parties. The highest amount contributed on weekdays towards Democrats is?  (In the column party, R stands for Republican and D stands for Democrats)

In [2]:
path1 = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/candidates.csv"
path2 = "/Users/gunnvantsaini/Library/CloudStorage/OneDrive-Personal/Work/Vired/Content/corp_trainings/tiger_analytics/data/contributions.csv"
candidates = pd.read_csv(path1)
contributions = pd.read_csv(path2)

In [3]:
candidates.head(2)

   id first_name  last_name middle_name party
0  33     Joseph      Biden         NaN     D
1  36     Samuel  Brownback         NaN     R

In [4]:
contributions.head(2)

,id,last_name,first_name,middle_name,street_1,street_2,city,state,zip,amount,date,candidate_id
0,NaN,Agee,Steven,NaN,549 Laurel Branch Road,NaN,Floyd,VA,24091,500.0,2007-06-30,16
1,NaN,Ahrens,Don,NaN,4034 Rennellwood Way,NaN,Pleasanton,CA,94566,250.0,2007-05-16,16

In [5]:
contributions['date'] = pd.to_datetime(contributions['date'])

In [6]:
contributions['dow'] = contributions['date'].dt.weekday

In [17]:
## Q1
contributions.query("dow==6")['amount'].max()

2300.0

In [9]:
joined_table = pd.merge(contributions,candidates,how="inner",left_on = "candidate_id", right_on="id")

In [10]:
joined_table.head(2)

,id_x,last_name_x,first_name_x,middle_name_x,street_1,street_2,city,state,zip,amount,date,candidate_id,dow,id_y,first_name_y,last_name_y,middle_name_y,party
0,NaN,Agee,Steven,NaN,549 Laurel Branch Road,NaN,Floyd,VA,24091,500.0,2007-06-30,16,5,16,Mike,Huckabee,NaN,R
1,NaN,Ahrens,Don,NaN,4034 Rennellwood Way,NaN,Pleasanton,CA,94566,250.0,2007-05-16,16,2,16,Mike,Huckabee,NaN,R

In [20]:
## weekday (Q2)
joined_table.query("party == 'D' and dow <5")['amount'].mean()

229.18571428571425

In [18]:
## weekend (Q2)
joined_table.query("party == 'D' and dow>=5")['amount'].mean()

431.26125

In [19]:
## Q3
joined_table.query("party == 'D' and dow <5")['amount'].max()

4600.0